app/views/kadmin/reserve_rulers/index.html.erb

SELECT `profiles`.* FROM `profiles` WHERE (`profiles`.user_id = 10280) LIMIT 1
---
  <tr class="<%= cycle('odd', 'even') %>">
    <td><%= link_to reserve_ruler.try(:user).try(:profile).try(:name) , [:kadmin,reserve_ruler.try(:user)] if reserve_ruler.try(:user).present? %></td>