app/views/kadmin/products/edit.html.erb

    <%= f.label :category_id, '*所属分类: ' %>
    <%= f.select :category_id, @categories, {},
      {'onchange' => remote_function(
        :with => "'category='+value",
        :update => 'next_select',
        :url => { :controller=>:products , :action => :select_with_ajax }
      )} %>
---
SELECT `categories`.* FROM `categories`