app/views/kadmin/products/index.html.erb

    <td><%= product.subcategory.name %></td>
    <td><%= link_to '共' + h(product.photos.count) + '图',
      kadmin_product_photos_path(product) %></td>
---
SELECT COUNT(*) FROM `photos` WHERE (`photos`.product_id = 10013)