app/views/kadmin/products/new.html.erb

SELECT `categories`.* FROM `categories`
---
    <%= f.label :category_id, '*所属分类: ' %>
    <%= f.select :category_id, @categories, {},
      {'onchange' => remote_function(
        :with => "'category='+value",
        :update => 'next_select',
        :url => {:action => :select_with_ajax}
      )} %>