app/views/subcategories/show.html.erb

SELECT COUNT(*) FROM `products` WHERE (`products`.subcategory_id = 4)
---

  <p>共 <em><%= @subcategory.products.count %></em> 件商品</p>