app/views/kadmin/users/index.html.erb

SELECT COUNT(*) FROM `orders` WHERE (`orders`.user_id = 10270)
---
    <td><%= user.human_role %></td>
    <td><%= link_to(h(user.orders.count.to_s + '单'),
                    kadmin_orders_path(:user_id => user)) %></td>