app/views/kadmin/users/show.html.erb

SELECT COUNT(*) FROM `measures` WHERE (`measures`.user_id = 10259)
---
      <p style="color:white">
      <strong>(共<%= @user.measures.count %>份)身材资料：</strong>

SELECT COUNT(*) FROM `orders` WHERE (`orders`.user_id = 10259)
---
      <p style="color:white">
      <strong>(共<%= @user.orders.count %>笔)该用户的订单：</strong>