app/controllers/blog_comments_controller.rb

  def create
    @blog_post = BlogPost.find(params[:blog_post_id])
    @blog_comment = BlogComment.new({ blog_post_id: params[:blog_post_id],content: params[:content],user_id: current_user.id })
    if @blog_comment.save
---
SELECT `blog_posts`.* FROM `blog_posts` WHERE (`blog_posts`.`id` = 21) LIMIT 1
INSERT INTO `blog_comments` (`blog_post_id`, `user_id`, `content`, `created_at`, `updated_at`) VALUES (21, 10003, ' sd', '2011-09-10 09:43:19', '2011-09-10 09:43:19')