app/controllers/blog_posts_controller.rb

  def index
    @blog_posts = if params[:c]
      BlogPost.paginate(:conditions=>{:category_id=>params[:c],:published=>true},:page=>params[:page],:order=>"created_at DESC")
    elsif params[:tag]
      blog_post_ids = BlogTag.where(:name=>params[:tag]).map(&:id)
      BlogPost.paginate(:conditions=>["published = ? AND id IN (?)",1,blog_post_ids],:page=>params[:page],:order=>"created_at DESC")
    else
      BlogPost.paginate(:conditions=>{:published=>true},:page=>params[:page],:order=>"created_at DESC")
    end
    if @blog_posts.present?
      blog_post = @blog_posts.sample
      @products = blog_post.products
    end
    @blog_categories = BlogCategory.all
---
SELECT COUNT(*) FROM `blog_posts` WHERE (`blog_posts`.`published` = 1)
SELECT `blog_posts`.* FROM `blog_posts` WHERE (`blog_posts`.`published` = 1) ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT `blog_categories`.* FROM `blog_categories`
SELECT `categories`.* FROM `categories` ORDER BY popularity DESC, created_at ASC

  def show
    @blog_post = BlogPost.find(params[:id])
    @user = @blog_post.user
    @profile = @user.profile
    @products = @blog_post.products
    @blog_categories = BlogCategory.all
---
SELECT `blog_posts`.* FROM `blog_posts` WHERE (`blog_posts`.`id` = 21) LIMIT 1
SELECT `blog_categories`.* FROM `blog_categories`
SELECT `categories`.* FROM `categories` ORDER BY popularity DESC, created_at ASC