app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories` WHERE (`categories`.`url` = 'suit') LIMIT 1
SELECT `categories`.* FROM `categories` ORDER BY popularity DESC, created_at ASC
SELECT `subcategories`.* FROM `subcategories` WHERE (`subcategories`.category_id = 1) ORDER BY popularity DESC, popularity DESC, created_at ASC LIMIT 1
---
  def show
    category = Category.find_by_url(params[:category].strip)
    if category.nil?
      go_home('您要查看的分类下暂无商品') and return
    end
    subcategory = category.subcategories.first(:order =>'popularity DESC, created_at ASC')

SELECT `banners`.* FROM `banners` ORDER BY popularity DESC, created_at DESC
SELECT `top_rulers`.* FROM `top_rulers` LIMIT 2
SELECT `users`.* FROM `users` WHERE (`users`.`id` IN (10258,10259))
SELECT `blog_posts`.* FROM `blog_posts` ORDER BY created_at DESC LIMIT 7
SELECT `categories`.* FROM `categories` ORDER BY popularity DESC, created_at ASC
SELECT `products`.* FROM `products` INNER JOIN `subcategories` ON `products`.subcategory_id = `subcategories`.id WHERE ((`subcategories`.category_id = 1)) ORDER BY our_price ASC, popularity DESC LIMIT 6
---
  def load_vars
    # banners = Banner.all(:order => 'popularity DESC, created_at DESC')
    # @scrolling_banners = banners.find_all {|i| i.can_scroll == true and i.popularity < Banner::TOP_BANNER}
    # @top_banners = banners.find_all {|i| i.popularity == Banner::TOP_BANNER}
    # @side_banners = banners.find_all {|i| i.popularity < Banner::TOP_BANNER and i.can_scroll == false}
    # @top_rulers = TopRuler.includes("user").limit(2)
    # @posts = BlogPost.limit(7).order("created_at DESC")

    banners = Banner.all(:order => 'popularity DESC, created_at DESC',:conditions=>"popularity < 10")
    @scrolling_banners = banners.find_all {|i| i.can_scroll == true and i.popularity < Banner::TOP_BANNER}
    @suit_banner = Banner.where(:popularity=>Banner::HOME_SUIT).order("created_at ASC").last
    @shirt_banner = Banner.where(:popularity=>Banner::HOME_SHIRT).order("created_at ASC").last
    @top_banners = banners.find_all {|i| i.popularity == Banner::TOP_BANNER}
    @side_banners = banners.find_all {|i| i.popularity < Banner::TOP_BANNER and i.can_scroll == false}
    @top_rulers = TopRuler.includes("user").limit(2)
    @posts = BlogPost.limit(7).order("created_at DESC")
    suit_category = Category.find_by_name("西服定制")
    @suit_products = suit_category.products.order('popularity DESC,our_price ASC').limit(5)