app/controllers/helps_controller.rb

SELECT `helps`.* FROM `helps` WHERE (`helps`.`name` = 'contact') LIMIT 1
---
  def show
    @help = Help.find_by_name(params[:id].strip)