app/controllers/inquiries_controller.rb

  def index
    @inquiry = Inquiry.new
    @inquiries = Inquiry.paginate(:page => params[:page],
      :per_page => 20, :order => 'popularity DESC, created_at DESC')
---
SELECT COUNT(*) FROM `inquiries`
SELECT `inquiries`.* FROM `inquiries` ORDER BY popularity DESC, created_at DESC LIMIT 20 OFFSET 0