app/controllers/measure_pages_controller.rb

SELECT `measure_pages`.* FROM `measure_pages` WHERE (`measure_pages`.`id` = 1) LIMIT 1
SELECT `measure_properties`.* FROM `measure_properties` WHERE (`measure_properties`.measure_page_id = 1) ORDER BY popularity DESC, created_at DESC LIMIT 100
---
  def show
    @measure_page = (MeasurePage.find(params[:id]) || MeasurePage.find(:first))
    @other_meausre_pages = MeasurePage.find(:all, :limit => 100,
      :conditions => ["id != ?", @measure_page.id])

    @measure_properties = @measure_page.measure_properties.find(:all,
      :order => 'popularity DESC, created_at DESC', :limit => 100)