app/controllers/products_controller.rb

SELECT `products`.* FROM `products` WHERE (`products`.`id` = 10096) LIMIT 1
SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 2) LIMIT 1
SELECT `photos`.* FROM `photos` WHERE (`photos`.product_id = 10096) AND (popularity <= 10) ORDER BY popularity DESC
SELECT `subcategories`.* FROM `subcategories` WHERE (`subcategories`.`id` = 4) LIMIT 1
SELECT `comments`.* FROM `comments` WHERE (`comments`.product_id = 10096) AND (approved = 1) ORDER BY popularity DESC, created_at DESC
---
  def show
    @product = Product.find(params[:id])
    @category = @product.subcategory.category
    @measures = @product.measure.split(':')
    # @photos = @product.photos.find(:all, :order => 'popularity DESC',:conditions => ['popularity<?', Photo::MAIN])
    @photos = @product.photos.find(:all, :order => 'popularity DESC',:conditions => ['popularity <= ?', Photo::MAIN])
    @comments = @product.comments.find(:all, :conditions => ['approved = ?', true], :order => 'popularity DESC, created_at DESC').paginate :page => params[:page], :per_page => 20

SELECT `products`.* FROM `products` WHERE (`products`.`id` = 10096) LIMIT 1
---
  def reserve
    @product = Product.find(params[:id])