app/controllers/subcategories_controller.rb

SELECT `subcategories`.* FROM `subcategories` WHERE (`subcategories`.category_id = 1) ORDER BY popularity DESC, popularity DESC, created_at DESC
SELECT `categories`.* FROM `categories` WHERE (`categories`.`url` = 'images') LIMIT 1
SELECT COUNT(*) FROM `products` WHERE (`products`.subcategory_id = 4) AND ( color LIKE '%蓝色%' )
SELECT `products`.* FROM `products` WHERE (`products`.subcategory_id = 3) AND ( color LIKE '%粉色%' AND component LIKE '%纯棉%') ORDER BY our_price ASC, popularity DESC LIMIT 18 OFFSET 0
SELECT `banners`.* FROM `banners` WHERE (`banners`.`popularity` = 89) LIMIT 1
---
  def show
    @subcategories = @category.subcategories.find(:all, :order => 'popularity DESC, created_at DESC')
    @subcategory = @subcategories.find {|sub| sub.url == params[:subcategory].strip}
    if @subcategory.nil?
      go_home('您要查看的商品分类不存在') and return
    else
      cond = ""
      if params[:price] and params[:price] != "全部"
        cond << "our_price = '#{params[:price]}' "
      end
      if params[:color] and params[:color] != "全部"
        cond<< "AND color LIKE '%#{params[:color]}%' "
      end
      if params[:mianliao] and params[:mianliao] != "全部"
        cond << "AND component LIKE '%#{params[:mianliao]}%'"
      end
      cond.sub!(/^AND/,"");
      order = if params[:sort] == "价格"
        "our_price DESC"
      elsif params[:sort] == "最新"
        "created_at DESC"
      else
        "our_price ASC, popularity DESC"
      end
      @products = @subcategory.products.paginate  :conditions=>cond ,:page => params[:page], :per_page => 18, :order => order
    end

    @metas = "#{@category.name}: #{@subcategory.name}"
    @title = @metas + "-"
    @list_banner = if params[:category] == 'suit'
      Banner.where(:popularity=>Banner::LIST_BANNER_SUIT).first