app/controllers/users_controller.rb

INSERT INTO `profiles` (`name`, `address`, `zipcode`, `website`, `institution`, `phone`, `user_id`, `created_at`, `updated_at`, `height`, `figure`, `qq`, `weibo`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, 10282, '2011-09-15 14:32:55', '2011-09-15 14:32:55', NULL, NULL, NULL, NULL)
INSERT INTO `users` (`email`, `crypted_password`, `salt`, `remember_token`, `remember_token_expires_at`, `credit`, `discount`, `role`, `is_company`, `login_from`, `login_at`, `orders_count`, `created_at`, `updated_at`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`) VALUES ('asdasd@asd.com', '2d0b6935e409f625891b1be7240af75456845a04', 'd0edfd6ddada493803ef4c7e2cae75ab09092465', NULL, NULL, 0, 1.0, 2, 0, NULL, NULL, 0, '2011-09-15 14:32:55', '2011-09-15 14:32:55', NULL, NULL, NULL, NULL)
---
  def create
    cookies.delete :auth_token
    @user = User.new(params[:user])
    @user.role = User::USER
    @user.credit = 0
    @user.discount = 1
    if @user.save_with_captcha and Profile.create(:user_id => @user.id)

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 10258) LIMIT 1
---
  def ba
    @user = User.find(params[:id])