app/views/kadmin/categories/index.html.erb

    <td>
      <%= link_to '共 '+ category.subcategories.count.to_s + ' 项', [:kadmin, category, :subcategories] %>
---
SELECT COUNT(*) FROM `subcategories` WHERE (`subcategories`.category_id = 1)
SELECT `categories`.* FROM `categories` ORDER BY popularity DESC