app/controllers/kadmin/banners_controller.rb

SELECT `banners`.* FROM `banners` ORDER BY popularity DESC, created_at DESC LIMIT 30 OFFSET 0
---
  def index
    @banners = Banner.paginate :page => params[:page],
      :per_page => 30, :order => 'popularity DESC, created_at DESC'

SELECT `banners`.* FROM `banners` WHERE (`banners`.`id` = 9) LIMIT 1
---
  def show
    @banner = Banner.find(params[:id])

SELECT `banners`.* FROM `banners` WHERE (`banners`.`id` = 8) LIMIT 1
---
  def edit
    @banner = Banner.find(params[:id])

INSERT INTO `banners` (`name`, `photo_url`, `link_to`, `popularity`, `can_scroll`, `created_at`, `updated_at`) VALUES ('', '/images/upload/1320766381.jpg', '#', 89, 1, '2011-11-08 15:33:01', '2011-11-08 15:33:01')
---
  def create
    if params[:photo]
      params[:banner][:photo_url] = Photo.save_photo(params[:photo])

UPDATE `banners` SET `name` = 'xxxx', `updated_at` = '2011-11-08 15:33:23' WHERE (`banners`.`id` = 9)
SELECT `banners`.* FROM `banners` WHERE (`banners`.`id` = 9) LIMIT 1
---
  def update
    if params[:photo]
      params[:banner][:photo_url] = Photo.save_photo(params[:photo])
    end
    @banner = Banner.find(params[:id])

SELECT `banners`.* FROM `banners` WHERE (`banners`.`id` = 9) LIMIT 1
DELETE FROM `banners` WHERE (`banners`.`id` = 9)
---
  def destroy
    @banner = Banner.find(params[:id])
    Photo.delete(@banner.photo_url)