app/controllers/kadmin/blog_posts_controller.rb

  def index
    @blog_posts = BlogPost.order("created_at DESC")
---
SELECT `blog_posts`.* FROM `blog_posts` ORDER BY created_at DESC

  def create
    @blog_post = BlogPost.new(params[:blog_post].merge(:user_id=>current_user.id))
    if @blog_post.save
---
INSERT INTO `blog_posts` (`title`, `content`, `category_id`, `product1_id`, `product2_id`, `created_at`, `updated_at`, `user_id`, `published`, `blog_comments_count`) VALUES ('aa', '<p>\r\n	aa</p>\r\n', 2, 10012, 10013, '2012-02-11 03:12:55', '2012-02-11 03:12:55', 10003, 1, NULL)