app/controllers/kadmin/chats_controller.rb

  def index
    @chats = Chat.all
---
SELECT `chats`.* FROM `chats`

  def check
    if Chat.exists?(:viewed=>nil)
---
SELECT `chats`.`id` FROM `chats` WHERE (`chats`.`viewed` IS NULL) LIMIT 1