app/controllers/kadmin/orders_controller.rb

SELECT `orders`.* FROM `orders` WHERE (progress='待确认') ORDER BY updated_at DESC LIMIT 20 OFFSET 0
---
  def index
    if params[:c]
      condition = ['progress=?', params[:c]]
    elsif params[:user_id]
      condition = ['user_id=?', params[:user_id]]
    else
      condition = ['progress=?', Order::PENDING]
    end
    @order_category = params[:c]
    @orders = Order.paginate :page => params[:page], :conditions => condition,:per_page => 20, :order => 'updated_at DESC'