app/controllers/kadmin/photos_controller.rb

SELECT `photos`.* FROM `photos` WHERE (`photos`.product_id = 10193) ORDER BY popularity DESC LIMIT 20 OFFSET 0
---
  def index
    @photos = @product.photos.paginate(:all, :page => params[:page], :per_page => 20, :order => 'popularity DESC')

SELECT `photos`.* FROM `photos` WHERE (`photos`.product_id = 10012) AND (`photos`.`id` = 669) LIMIT 1
---
  def show
    @photo = @product.photos.find(params[:id])

INSERT INTO `photos` (`name`, `url`, `popularity`, `mark`, `product_id`, `created_at`, `updated_at`) VALUES ('car', '/images/upload/1316188855.jpg', 0, NULL, 10012, '2011-09-16 16:00:55', '2011-09-16 16:00:55')
---
  def create
    if params[:photo][:url].empty? and params[:photo][:image]
      params[:photo][:url] = Photo.save_photo(params[:photo][:image])

SELECT `photos`.* FROM `photos` WHERE (`photos`.product_id = 10012) AND (`photos`.`id` = 69) LIMIT 1
DELETE FROM `photos` WHERE (`photos`.`id` = 69)
---
  def destroy
    @photo = @product.photos.find(params[:id])
    Photo.delete(@photo.url)