app/controllers/kadmin/products_controller.rb

  def index
    statement = {:page => params[:page],
      :per_page => 30, :order => 'popularity DESC'}
    if params[:subcategory]
      statement[:conditions] = ["subcategory_id = ?", params[:subcategory]]
    end
    @products = Product.paginate(statement)
---
SELECT COUNT(*) FROM `products`
SELECT `products`.* FROM `products` ORDER BY popularity DESC LIMIT 30 OFFSET 0

  def edit
    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE (`products`.`id` = 10012) LIMIT 1

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`name`, `serial_number`, `origin`, `component`, `yarn`, `color`, `description`, `details`, `market_price`, `our_price`, `measure`, `subcategory_id`, `popularity`, `availability`, `photos_count`, `comments_count`, `created_at`, `updated_at`, `customizable`, `contact`, `for_who`, `for_where`, `weight`, `pictures_show`, `material_picture`) VALUES ('asdasd', 'asdad', '', '', '', '', NULL, '', 1231, 12, '', 1, 0, 1, 0, 0, '2011-09-14 15:12:15', '2011-09-14 15:12:15', 0, '', '', '', '', '<p>\r\n	xxxxxxxx</p>\r\n', NULL)

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT `products`.* FROM `products` WHERE (`products`.`id` = 10012) LIMIT 1
UPDATE `products` SET `contact` = '', `for_who` = '', `for_where` = '', `weight` = '', `pictures_show` = '<p>\r\n	<img alt=\"\" src=\"/ckeditor_assets/pictures/72/content_屏幕快照 2011-09-09 11.36.36 AM.png?1315662494\" style=\"width: 575px; height: 359px;\" /></p>\r\n', `updated_at` = '2011-09-10 13:48:30' WHERE (`products`.`id` = 10012)