app/controllers/kadmin/reserve_rulers_controller.rb

  def index
    @reserve_rulers = ReserveRuler.paginate :page=>params[:page] , :order=>"created_at DESC"
---
SELECT `reserve_rulers`.* FROM `reserve_rulers` ORDER BY created_at DESC LIMIT 30 OFFSET 0

  def destroy
    @rr = ReserveRuler.find(params[:id])
    if @rr.destroy
---
SELECT `reserve_rulers`.* FROM `reserve_rulers` WHERE (`reserve_rulers`.`id` = 11) LIMIT 1
DELETE FROM `reserve_rulers` WHERE (`reserve_rulers`.`id` = 11)