app/controllers/kadmin/uploaded_photos_controller.rb

  def index
    @uploaded_photos = Photo.paginate :page => params[:page], :per_page => 30,
      :order => 'popularity DESC'
---
SELECT COUNT(*) FROM `photos`
SELECT `photos`.* FROM `photos` ORDER BY popularity DESC LIMIT 30 OFFSET 0