app/controllers/kadmin/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` ORDER BY is_company DESC, created_at DESC, credit DESC LIMIT 30 OFFSET 0
---
  def index
    condition = {:page => params[:page], :per_page => 30, :order => 'is_company DESC, created_at DESC, credit DESC'}
    if params[:email]
      condition[:conditions] = ['email like ?', params[:email]]
    end
    @users = User.paginate(condition)

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 10003) LIMIT 1
SELECT `orders`.* FROM `orders` WHERE (`orders`.user_id = 10259) LIMIT 15
SELECT `profiles`.* FROM `profiles` WHERE (`profiles`.user_id = 10259) LIMIT 1
SELECT `measures`.* FROM `measures` WHERE (`measures`.user_id = 10259) LIMIT 15
---
  def show
    @user = User.find(params[:id])
    @profile = @user.profile
    @orders = @user.orders.find(:all, :limit => 15)
    @measures = @user.measures.find(:all, :limit => 15)