app/views/layouts/_ruler.html.erb

        <%= select_tag "city" , raw("<option>北京市</option>")  %>
        <%= f.select "place_id"  , options_from_collection_for_select(Place.all,'id','area') , :include_blank=>true %>
---
SELECT `places`.* FROM `places` WHERE (`places`.user_id = 10258)

      <div><span>体验店:</span>
        <%= select_tag "reserve_shop[shop_id]" , options_from_collection_for_select(Shop.all,:id,:name), { :include_blank=>true }  %>
---
SELECT `shops`.* FROM `shops`